[PersonalShield X2AbilityTemplate]
LocFriendlyName="Personal Shield"
LocLongDescription="Sets a personal shield around the Soldier to help keep him safe from harm."
LocHelpText="Sets up a personal shield for 4 turns."
LocFlyOverText="Personal Shield"
LocPromotionPopupText="<Bullet/> Shields the Soldier from harm for 4 turns by creating a personal shield.<br/>"

